<!DOCTYPE html>
<html>
<head>
  <title>The Library of Babel &mdash; La Biblioteko de Babelo</title>
  <meta charset="utf-8">
  <style>
		body
		{
			font-family: "FreeSerif","Times",serif;margin:0 auto;padding:0;max-width:800px;
		}
    h1,h2,h3,h5
    {
      text-align:center;margin:0;
    }
    h2,h3,h5{font-weight:normal;}
		table tr td
		{
			width: 50vw;
			padding: 0 20px;
			vertical-align: top;
		}
table.titolo{padding: 20px;}
    p
    {
      text-align:justify;
    }
blockquote{padding-top:10px;width:400px;margin:0 auto;text-align:justify;}
	</style>
</head>
<body>
<table class="titolo"><tr>
<td><h1>The Library of Babel</h1></td>
<td><h1>La Biblioteko de Babelo</h1></td>
</tr></table>
<h2>Jorge Luis Borges</h2>
<blockquote><i>By this art you may contemplate the variations of the 23 letters...</i><br>The Anatomy of Melancholy, part 2, sect. II, mem. IV</blockquote>
<table class="titolo"><tr>
<td><h3><i>English:</i> James E. Irby<br></h3></td>
<td><h3><i>Esperanto:</i> Manuel Giorgini</h3></td>
</tr></table>
<table>
<tr>
<td>
<p>The universe (which others call the Library) is composed of an indefinite and perhaps infinite number of hexagonal galleries, with vast air shafts between, surrounded by very low railings.  From any of the hexagons one can see, interminably, the upper and lower floors.  The distribution of the galleries is invariable.  Twenty shelves, five long shelves per side, cover all the sides except two; their height, which is the distance from floor to ceiling, scarcely exceeds that of a normal bookcase.  One of the free sides leads to a narrow hallway which opens onto another gallery, identical to the first and to all the rest.  To the left and right of the hallway there are two very small closets.  In the first, one may sleep standing up; in the other, satisfy one's fecal necessities.  Also through here passes a spiral stairway, which sinks abysmally and soars upwards to remote distances.  In the hallway there is a mirror which faithfully duplicates all appearances.  Men usually infer from this mirror that the Library is not infinite (if it were, why this illusory duplication?); I prefer to dream that its polished surfaces represent and promise the infinite ... Light is provided by some spherical fruit which bear the name of lamps.  There are two, transversally placed, in each hexagon.  The light they emit is insufficient, incessant.</p>
</td><td>
<p>La Universo (kiun aliaj nomas Biblioteko) konsistas je nedifina, kaj eble senfina, nombro de sesangulaj galerioj, kun grandaj aerumaj putoj meze, &#x109;irka&#x16D;igitaj de malaltaj balustradoj. El iu ajn heksagono videblas la supraj kaj malsupraj eta&#x11D;oj, senfine. La distribuado de la a&#x135;oj en la galerioj estas Senŝan&#x11D;a. Dudek kvin grandaj bretoj, po 5 por &#x109;iu flanko, kovras &#x109;iun flankon krom unu; ilia alteco, kiu samas al tiu de la eta&#x11D;o mem, ne tro superas tiun de iu ajn normala biblioteko. La libera flanko frontas al mallar&#x11D;a koridoro kiu siavice frontas al alia galerio, samforma al la unua kaj al &#x109;iuj. Dekstre kaj maldekstre de la koridoro estas du malgrandaj kabinetoj. Per la unua oni povas dormi stare, per la dua plenumi proprajn necesojn. El &#x109;i tie oni iras al la spirala ŝtuparo, kiu levi&#x11D;as kaj mallevi&#x11D;as senfine. En la koridoro estas spegulo kiu fidele duobligas la aspektojn. La homoj kutime konkludas el tiu spegulo ke la Biblioteko ne estas senfina (se vere estus, kial estus &#x109;i tiu nevera duobligo?); mi preferas revi ke &#x109;i tiuj ar&#x11D;entaj surfacoj formigas kaj promesas la senfinon... La lumo venas el sferformaj fruktoj kiuj nomi&#x11D;as Lampoj. Estas po du por heksagono, la&#x16D; transversa linio. La lumo kiun ili produktas estas sen&#x109;esa, nesufi&#x109;a.</p>
</td></tr><tr><td>
<p>Like all men of the Library, I have traveled in my youth; I have wandered in search of a book, perhaps the catalogue of catalogues; now that my eyes can hardly decipher what I write, I am preparing to die just a few leagues from the hexagon in which I was born.  Once I am dead, there will be no lack of pious hands to throw me over the railing; my grave will be the fathomless air; my body will sink endlessly and decay and dissolve in the wind generated by the fall, which is infinite.  I say that the Library is unending.  The idealists argue that the hexagonal rooms are a necessary form of absolute space or, at least, of our intuition of space.  They reason that a triangular or pentagonal room is inconceivable.  (The mystics claim that their ecstasy reveals to them a circular chamber containing a great circular book, whose spine is continuous and which follows the complete circle of the walls; but their testimony is suspect; their words, obscure.  This cyclical book is God.)  Let it suffice now for me to repeat the classic dictum: <i>The Library is a sphere whose exact center is any one of its hexagons and whose circumference is inaccessible.</i></p>
</td><td>
<p>Kiel &#x109;iu homo en la Biblioteko, dum mia juneco mi voja&#x11D;is; mi migris ser&#x109;ante libron, eble la katalogon de la katalogoj; nun, miaj okuloj preska&#x16D; ne kapablas decifri tion kion mi skribas, kaj mi preti&#x11D;as morti ne malproksime el la heksagono en kiu mi naski&#x11D;is. Mortinta, ne mankos kompatemaj manoj kiuj &#x135;etos min for de la balustrado; la nesondebla aero estos mia sepultado; mia korpo dronos kaj detrui&#x11D;os en la vento farita de la falado, kiu estas senfina. Mi asertas ke la biblioteko estas senlima. La idealistoj temumas ke la heksagonformaj salonoj estas necesa formo de la absoluta spaco, a&#x16D; almena&#x16D;, de nia diveno de la spaco. Ili rezonas ke iu triangula a&#x16D; kvinangula salono estas tute nepensebla (la Mistikuloj asertas havi dum ekstazo la riveladon de rondforma &#x109;ambro, kiu enhavas grandan cirklan libron, kontinudorsan, kiu komplete turni&#x11D;as &#x109;irka&#x16D; la flankoj; sed ilia atesto estas suspekta, iliaj vortoj malhelaj. &#x108;i tiu cikla libro estas Dio). Sufi&#x109;u nun al mi, ripeti la klasikan aserton: <i>la Biblioteko estas sfero kies preciza centro estas iu ajn heksagono kaj kies cirkonferenco estas neatingebla</i>.</p>
</td></tr><tr><td>
<p>There are five shelves for each of the hexagon's walls; each shelf contains thirty-five books of uniform format; each book is of four hundred and ten pages; each page, of forty lines, each line, of some eighty letters which are black in color.  There are also letters on the spine of each book; these letters do not indicate or prefigure what the pages will say.  I know that this incoherence at one time seemed mysterious.  Before summarizing the solution (whose discovery, in spite of its tragic projections, is perhaps the capital fact in history) I wish to recall a few axioms.</p>
</td><td>
<p>&#x108;iu muro de &#x109;iu heksagono enhavas kvin bretojn; &#x109;iu breto enhavas tridek du librojn samformajn; &#x109;iu libro konsistas je kvarcent dek pa&#x11D;oj; &#x109;iu pa&#x11D;o je kvardek linioj; &#x109;iu linio je kvardek literoj nigrkoloraj. Estas anka&#x16D; literoj sur la dorso de &#x109;iu libro; tamen, ili ŝajne ne celas nek helpas komprenigi la enhavon de la pa&#x11D;oj. Mi scias ke iam &#x109;i tiu malkohereco ŝajnis mistera al mi. Anta&#x16D; paroli pri la solvo (kies malkovro, senregarde de &#x11D;iaj tragikaj projekcioj, estas la &#x109;efa afero en la historio), mi emas memorigi kelkajn aksiomojn.</p>
</td></tr><tr><td>
<p>First:  The Library exists <i>ab aeterno.</i>  This truth, whose immediate corollary is the future eternity of the world, cannot be placed in doubt by any reasonable mind.  Man, the imperfect librarian, may be the product of chance or of malevolent demiurgi; the universe, with its elegant endowment of shelves, of enigmatical volumes, of inexhaustible stairways for the traveler and latrines for the seated librarian, can only be the work of a god.  To perceive the distance between the divine and the human, it is enough to compare these crude wavering symbols which my fallible hand scrawls on the cover of a book, with the organic letters inside: punctual, delicate, perfectly black, inimitably symmetrical.</p>
</td><td>
<p>Unue: la Biblioteko ekzistas <i>Ab Aeterno</i>. Tiun verecon, kies tuja korolario estas la estonta eterneco de la mondo, neniu racia menso povas dubi. La homo, &#x109;i tiu malperfekta bibliotekisto, povas esti produkto hazarda, a&#x16D; de misintencaj demiurgoj; la Universo, kaj &#x11D;ia eleganta konsisto de bretoj, enigmoplenaj libroj, nelaceblaj ŝtuparoj por la voja&#x11D;anto kaj necesejoj por la sidita bibliotekisto, ne povas ne esti produkto de iu dio. Por ekkompreni la distancon inter dieco kaj homeco, sufi&#x109;as kompari &#x109;i tiujn a&#x109;ajn, tremoplenajn simbolojn kiujn mia erarpova mano skriba&#x109;as sur la koverto de iu libro, kun la sistemaj literoj en la enhavo de la libro: akurataj, dol&#x109;aj, nigregaj, neniam malsimetriaj.</p>
</td></tr><tr><td>
<p>Second:  <i>The orthographical symbols are twenty-five in number.</i><sup>(1)</sup> This finding made it possible, three hundred years ago, to formulate a general theory of the Library and solve satisfactorily the problem which no conjecture had deciphered:  the formless and chaotic nature of almost all the books.  One which my father saw in a hexagon on circuit fifteen ninety-four was made up of the letters MCV, perversely repeated from the first line to the last.  Another (very much consulted in this area) is a mere labyrinth of letters, but the next-to-last page says <i>Oh time thy pyramids.</i>  This much is already known:  for every sensible line of straightforward statement, there are leagues of senseless cacophonies, verbal jumbles and incoherences.  (I know of an uncouth region whose librarians repudiate the vain and superstitious custom of finding a meaning in books and equate it with that of finding a meaning in dreams or in the chaotic lines of one's palm ... They admit that the inventors of this writing imitated the twenty-five natural symbols, but maintain that this application is accidental and that the books signify nothing in themselves. This dictum, we shall see, is not entirely fallacious.)</p>
</td><td>
<p>Due: <i>la kvanto da ortografiaj simboloj estas je dudek kvin.</i><sup>(1)</sup> Tiu konstato ebligis, anta&#x16D; jam tri jarcentoj, formigon de &#x11D;enerala teorio de la biblioteko kaj solvadon kontentigan de la problemo, kiun neniu konjektado povis de&#x109;ifri: la &#x125;aosa, senforma naturo de preska&#x16D; &#x109;iu libro. Unu el ili, kiun mia patro trovis en la heksagono de la rondo 15-98, konsistis je la literoj MCV, perverse ripetitaj de la unua &#x11D;is la lasta linio. Iu alia (tre ofte legita en &#x109;i tiu zono) estas simpla litera labirinto, sed la lasta pa&#x11D;o diras: <i>Ho tempo, viaj piramidoj</i>. Jam nun &#x109;iu scias: por &#x109;iu komprenebla linio, estas miloj da sensencaj kakofonioj, vortaj konfuzamasoj kaj malkoheroj (mi scias pri iu barbara regiono kies bibliotekistoj malakceptas la vanan kaj supersti&#x109;an kutimon ser&#x109;i sencon en la libroj, kaj komparas &#x11D;in al sencoser&#x109;ado pri son&#x11D;oj a&#x16D; manolinioj... Ili konsentas pri la fakto ke la inventintoj de la skribado imitis la dudek kvin naturajn simbolojn, sed asertas ke &#x109;i tiu apliko estas tute hazarda, kaj ke la libroj mem ne signifas ion ajn. &#x108;i tiu konkludo, kiel ni vidos poste, ne estas tute erara).</p>
</td></tr><tr><td>
<p>For a long time it was believed that these impenetrable books corresponded to past or remote languages.  It is true that the most ancient men, the first librarians, used a language quite different from the one we now speak; it is true that a few miles to the right the tongue is dialectical and that ninety floors farther up, it is incomprehensible.  All this, I repeat, is true, but four hundred and ten pages of inalterable MCV's cannot correspond to any language, no matter how dialectical or rudimentary it may be.  Some insinuated that each letter could influence the following one and that the value of MCV in the third line of page 71 was not the one the same series may have in another position on another page, but this vague thesis did not prevail.  Others thought of cryptographs; generally, this conjecture has been accepted, though not in the sense in which it was formulated by its originators.</p>
</td><td>
<p>Dum longa tempo oni kredis, ke &#x109;i tiuj nekompreneblaj libroj konformis al malaperintaj a&#x16D; malproksimegaj lingvoj. Nu, estas vere ke la prahomoj, la unuaj bibliotekistoj, parolis lingvon kiu estas ege malsimila al la nuna; estas vere ke post na&#x16D; milioj dekstren la lingvo jam dialektas kaj na&#x16D;dek eta&#x11D;oj supren &#x11D;i estas nekomprenebla. &#x108;io &#x109;i, denove, estas ja vera; sed kvarcent dek pa&#x11D;oj de neŝan&#x11D;aj MCV ne povas konformi al iu ajn idiomo, e&#x109; dialektega a&#x16D; praega. Kelkaj enŝovis ke &#x109;iu litero povus influi la venontan, kaj ke la valoro de MCV en la tria linio de la pa&#x11D;o sekdep unua ne estis la sama de tiu kiu aperas en alia linio de alia pa&#x11D;o; sed tiu malpreciza tezo ne sukcesis. Aliaj homoj pensis al kriptografio; tiu hipotezo estis universale akceptita, sed ne tute kiel &#x11D;iaj inventintoj &#x11D;in ellaboris.</p>
</td></tr><tr><td>
<p>Five hundred years ago, the chief of an upper hexagon<sup>(2)</sup> came upon a book as confusing as the others, but which had nearly two pages of homogeneous lines.  He showed his find to a wandering decoder who told him the lines were written in Portuguese; others said they were Yiddish. Within a century, the language was established:  a Samoyedic Lithuanian dialect of Guarani, with classical Arabian inflections.  The content was also deciphered:  some notions of combinative analysis, illustrated with examples of variations with unlimited repetition.  These examples made it possible for a librarian of genius to discover the fundamental law of the Library.</p>
</td><td>
<p>Anta&#x16D; kvincent jaroj, la &#x109;efulo de iu supra heksagono<sup>(2)</sup> trovis libron konfuzan kiel la aliaj, sed en kiu estis &#x109;irka&#x16D; du pa&#x11D;oj da homogena, ŝajne legebla verkado. Li montris tion al migranta tradukisto, kaj &#x109;i-lasta diris al li ke la pa&#x11D;oj estis skribitaj en la portugala; aliaj diris al li ke temis pri la jida lingvo. Oni povis finfine konkludi, post ser&#x109;ado kiu da&#x16D;ris &#x109;irka&#x16D; unu jarcenton, ke temis pri dialekto samojeda-litova de gvarania lingvo, influita de klasika araba lingvo. Oni de&#x109;ifris anka&#x16D; la enhavon: nocioj de kombinatoriko, ilustritaj per ekzemploj de senlime ripetaj permuta&#x135;oj. Tiuj ekzemploj kapabligis genian bibliotekiston malkovri la fundamentan le&#x11D;on de la Biblioteko.</p>
</td></tr><tr><td>
<p>This thinker observed that all the books, no matter how diverse they might be, are made up of the same elements:  the space, the period, the comma, the twenty-two letters of the alphabet.  He also alleged a fact which travelers have confirmed:  <i>In the vast Library there are no two identical books.</i>  From these two incontrovertible premises he deduced that the Library is total and that its shelves register all the possible combinations of the twenty-odd orthographical symbols (a number which, though extremely vast, is not infinite):  Everything:  the minutely detailed history of the future, the archangels' autobiographies, the faithful catalogues of the Library, thousands and thousands of false catalogues, the demonstration of the fallacy of those catalogues, the demonstration of the fallacy of the true catalogue, the Gnostic gospel of Basilides, the commentary on that gospel, the commentary on the commentary on that gospel, the true story of your death, the translation of every book in all languages, the interpolations of every book in all books.</p>
</td><td>
<p>Tiu sa&#x11D;ulo konstatis ke &#x109;iuj libroj, e&#x109; malsamegaj, konsistis je la samaj bazaj elementoj: la spaco, la punkto, la komo, la dudek du alfabetaj literoj. Li anka&#x16D; finformigis konjekton kiun &#x109;iu voja&#x11D;anto konfirmis: ne ekzistas, en la Biblioteko, du tute egalaj libroj. El tiuj nerefuteblaj premisoj li konkludis ke la Biblioteko estas Totala, kaj ke &#x11D;iaj bretoj registras &#x109;iun eblan kombinon de la dudek kvin ortografiaj simboloj (nombro kiu, kvankam grandega, ne estas senfina), alivorte &#x109;ion, kion oni povas esprimi per &#x109;iu lingvo. &#x108;io: la &#x11D;isdetala historio de la estonteco, la a&#x16D;tobiografioj de la &#x109;efan&#x11D;eloj, la fidela katalogo de la biblioteko, miloj kaj miloj da falsaj katalogoj, la pruvado de la falseco de tiuj katalogoj, la pruvado de la falseco de la fidela katalogo, la gnostika van&#x11D;elo de Basilido, la komento de tiu van&#x11D;elo, la komento de la komento de tiu van&#x11D;elo, la verŝajna raporto de VIA morto, la traduko de &#x109;iu libro en &#x109;iun lingvon, la interpolado de &#x109;iu libro en &#x109;iujn librojn.</p>
</td></tr><tr><td>
<p>When it was proclaimed that the Library contained all books, the first impression was one of extravagant happiness.  All men felt themselves to be the masters of an intact and secret treasure.  There was no personal or world problem whose eloquent solution did not exist in some hexagon.  The universe was justified, the universe suddenly usurped the unlimited dimensions of hope.  At that time a great deal was said about the Vindications:  books of apology and prophecy which vindicated for all time the acts of every man in the universe and retained prodigious arcana for his future.  Thousands of the greedy abandoned their sweet native hexagons and rushed up the stairways, urged on by the vain intention of finding their Vindication.  These pilgrims disputed in the narrow corridors, proferred dark curses, strangled each other on the divine stairways, flung the deceptive books into the air shafts, met their death cast down in a similar fashion by the inhabitants of remote regions.  Others went mad ... The Vindications exist (I have seen two which refer to persons of the future, to persons who are perhaps not imaginary) but the searchers did not remember that the possibility of a man's finding his Vindication, or some treacherous variation thereof, can be computed as zero.</p>
</td><td>
<p>Kiam oni proklamis ke la Biblioteko enhavis &#x109;iun libron, la unua impreso estis eksterordinare feli&#x109;a. &#x108;iu homo sentis sin posedanto de netuŝita kaj fidela trezoro. Ne plu ekzistis iu ajn persona a&#x16D; monda problemo, kies solvo ne ekzistis: en iu heksagono. La Universo estis klarigebla, la universo abrupte atingis la senlimajn dimensiojn de l'Espero. Tiam oni multe parolis pri la Ven&#x11D;adoj: libroj apologiaj kaj profetaj kiuj por &#x109;iam pravigis la agojn de &#x109;iu homo en la universo kaj enhavis strangajn misterojn por &#x11D;ia estonteco. Miloj da ambiciuloj forlasis siajn proprajn naski&#x11D;ajn heksagonojn kaj &#x135;eti&#x11D;is supren la&#x16D; la ŝtuparoj, movitaj de la vana celo trovi propran Ven&#x11D;adon. Tiuj migrintoj enbatali&#x11D;is en la mallar&#x11D;aj koridoroj, &#x135;etis trompemajn librojn en la senfundajn putojn, tie mortis ili mem, &#x135;etitaj el homoj de malproksimaj regionoj. Multaj frenezi&#x11D;is. La Ven&#x11D;adoj vere ekzistas (mi vidis du, kiuj parolas pri personoj estontaj, kaj eble ne imagitaj), sed tiuj ser&#x109;intoj forgesis ke la ebleco trovi la propran, a&#x16D; iun ajn nefidelan varia&#x135;on de la propra, estas esence nula.</p>
</td></tr><tr><td>
<p>At that time it was also hoped that a clarification of humanity's basic mysteries &mdash; the origin of the Library and of time &mdash; might be found.  It is verisimilar that these grave mysteries could be explained in words:  if the language of philosophers is not sufficient, the multiform Library will have produced the unprecedented language required, with its vocabularies and grammars.  For four centuries now men have exhausted the hexagons ... There are official searchers, <i>inquisitors.</i>  I have seen them in the performance of their function:  they always arrive extremely tired from their journeys; they speak of a broken stairway which almost killed them; they talk with the librarian of galleries and stairs; sometimes they pick up the nearest volume and leaf through it, looking for infamous words. Obviously, no one expects to discover anything.</p>
</td><td>
<p>Anka&#x16D; oni esperis, tiam, je la klarigo de la fundamentaj misteroj de l' homaro: la originoj de la Biblioteko kaj de la Tempo. Estas verŝajne, ke oni povas doni vortan klarigon de tiuj gravaj misteroj: se la lingvo de la filozofoj ne sufi&#x109;as, la multforma Biblioteko certe produktis jam sian propran nea&#x16D;ditan idiomon necesan, kaj la vortarojn kaj la gramatikojn de &#x109;i tiu lingvo. Jam dum kvar jarcentoj la homoj lacigis la heksagonojn... Ekzistas oficialaj ser&#x109;istoj, inkvizitoroj. Mi vidis ilin labori: ili alvenas &#x109;iam senesperigitaj, parolas pri ŝtuparoj sen iu certa ŝtupo, kie ili riskis morti; parolas pri ŝtuparoj kaj galerioj kun bibliotekisto; foje, ili prenas la plej proksiman libron kaj &#x11D;in foliumas, ser&#x109;ante maldecajn vortojn. Videble, neniu vere atendas trovi ion.</p>
</td></tr><tr><td>
<p>As was natural, this inordinate hope was followed by an excessive depression.  The certitude that some shelf in some hexagon held precious books and that these precious books were inaccessible, seemed almost intolerable.  A blasphemous sect suggested that the searches should cease and that all men should juggle letters and symbols until they constructed, by an improbable gift of chance, these canonical books.  The authorities were obliged to issue severe orders.  The sect disappeared, but in my childhood I have seen old men who, for long periods of time, would hide in the latrines with some metal disks in a forbidden dice cup and feebly mimic the divine disorder.</p>
</td><td>
<p>Post la senlima espero, kiel kutime, senti&#x11D;is troa deprimi&#x11D;o. Ŝajnis kvaza&#x16D; elteneble scii ke ja en iu breto de iu heksagono ekzistis valoregaj libroj, kaj ke tiuj libroj estis praktike neatingeblaj. Iu blasfema sekto proponis ke oni interrompu la ser&#x109;adojn kaj ke &#x109;iu homo ekmiksu literojn kaj simbolojn por konstrui, pro preska&#x16D; neebla donaco hazarda, &#x109;i tiujn librojn. La istancoj sentis sin devigitaj aperigi striktajn le&#x11D;ojn. La sekto malaperis, sed kiam mi estis juna mi vidis maljunulojn kiuj longe kaŝi&#x11D;is en la necesejoj, kaj malforte strebis rimedi la dian malordon per metalaj disketoj.</p>
</td></tr><tr><td>
<p>Others, inversely, believed that it was fundamental to eliminate useless works.  They invaded the hexagons, showed credentials which were not always false, leafed through a volume with displeasure and condemned whole shelves:  their hygienic, ascetic furor caused the senseless perdition of millions of books.  Their name is execrated, but those who deplore the &ldquo;treasures&rdquo; destroyed by this frenzy neglect two notable facts.  One: the Library is so enormous that any reduction of human origin is infinitesimal.  The other:  every copy is unique, irreplaceable, but (since the Library is total) there are always several hundred thousand imperfect facsimiles:  works which differ only in a letter or a comma.  Counter to general opinion, I venture to suppose that the consequences of the Purifiers' depredations have been exaggerated by the horror these fanatics produced.  They were urged on by the delirium of trying to reach the books in the Crimson Hexagon:  books whose format is smaller than usual, all-powerful, illustrated and magical.</p>
</td><td>
<p>Aliaj, male, kredis ke kio estas grave, tio estas detrui la senutilajn verkojn. Ili invadis la heksagonojn, montris dokumentojn ne &#x109;iam falsajn, kolere foliumis iun libron kaj kondamnis la tutan breton: ilia higienema, asketa, senracia furiozo detruis milionojn da libroj. Oni malla&#x16D;das iliajn nomojn, sed tiuj kiuj tristas pro la &ldquo;trezoroj&rdquo; kiujn ilia frenezeco detruis, forgesas du gravajn aferojn. Unue: la Biblioteko tiom vastas, ke &#x109;iu malgrandigo homa estas infinitezima. Due: &#x109;iu specimeno estas unika, neanstata&#x16D;igebla, sed (&#x109;ar la Biblioteko estas Totala) restas tamen centmiloj da neperfektaj simila&#x135;oj, tio estas, libroj kiuj diferencas nur je unu litero a&#x16D; komo. Malsame al la &#x11D;enerala ju&#x11D;o, mi kredas tial ke la konsekvencoj de la agoj de tiuj Purigistoj estis troigitaj pro la hororo, kiun tiuj fanatikuloj instigis. Ilin anta&#x16D;enpuŝis la freneza ideo konkeri la librojn de la Karmezina Heksagono: libroj pli malgrandaj ol kutime; &#x109;ionpovaj, ilustritaj kaj magiaj.</p>
</td></tr><tr><td>
<p>We also know of another superstition of that time:  that of the Man of the Book.  On some shelf in some hexagon (men reasoned) there must exist a book which is the formula and perfect compendium <i>of all the rest:</i>  some librarian has gone through it and he is analogous to a god.  In the language of this zone vestiges of this remote functionary's cult still persist.  Many wandered in search of Him.  For a century they have exhausted in vain the most varied areas.  How could one locate the venerated and secret hexagon which housed Him?  Someone proposed a regressive method:  To locate book A, consult first book B which indicates A's position; to locate book B, consult first a book C, and so on to infinity ... In adventures such as these, I have squandered and wasted my years.</p>
</td><td>
<p>Ni anka&#x16D; scias pri alia tiama supersti&#x109;o: pri la Libra Homo. En iu breto de iu heksagono (la homoj pensis), devas ekzisti iu libro kiu estas la ŝlosilo kaj la kompendio <i>de &#x109;iuj aliaj</i>: iu bibliotekisto &#x11D;in legis, kaj nun li similas al Dio. En la lingvo de &#x109;i tiu zono estas konservitaj kelkaj signoj de la kulto de tiu malproksima oficisto. Multaj migras ser&#x109;ante Lin, vane puŝi&#x11D;is en la plej malproksimajn galeriojn. Kiel loki la eminentan sekretan heksagonon kiu Lin gastigas? Kelkaj proponis regresan manieron: por trovi la libron A, unue konsultu la libron B; por trovi la libron B, unue konsultu la libron C kaj tiel plu senfine... je tiaj adventuroj mi elspezis miajn jarojn.</p>
</td></tr><tr><td>
<p>It does not seem unlikely to me that there is a total book on some shelf of the universe;<sup>(3)</sup> I pray to the unknown gods that a man &mdash; just one, even though it were thousands of years ago! &mdash; may have examined and read it.  If honor and wisdom and happiness are not for me, let them be for others.  Let heaven exist, though my place be in hell.  Let me be outraged and annihilated, but for one instant, in one being, let Your enormous Library be justified.</p>
</td><td>
<p>Ne ŝajnas al mi neebla, ke en iu certa breto de la Universo ekzistas iu Totala Libro;<sup>(3)</sup> mi pre&#x11D;as la nekonatajn Diojn, por ke iu homo &mdash; e&#x109; se nur unu, e&#x109; se anta&#x16D; mil jaroj &mdash; &#x11D;in trovis kaj legis. Se la honoro, la sa&#x11D;eco kaj la feli&#x109;o ne estas por mi, estu por aliaj. Ekzistu la Paradizo, e&#x109; se mia loko estas en la Infero. Oni libere ofendu kaj detruu min, sed estu ke, e&#x109; en unu momento, en ununura homo, Via Granda Biblioteko pravi&#x11D;u!</p>
</td></tr><tr><td>
<p>The impious maintain that nonsense is normal in the Library and that the reasonable (and even humble and pure coherence) is an almost miraculous exception.  They speak (I know) of the &ldquo;feverish Library whose chance volumes are constantly in danger of changing into others and affirm, negate and confuse everything like a delirious divinity.&rdquo;  These words, which not only denounce the disorder but exemplify it as well, notoriously prove their authors' abominable taste and desperate ignorance.  In truth, the Library includes all verbal structures, all variations permitted by the twenty-five orthographical symbols, but not a single example of absolute nonsense.  It is useless to observe that the best volume of the many hexagons under my administration is entitled <i>The Combed Thunderclap</i> and another <i>The Plaster Cramp</i> and another <i>Axaxaxas ml&ouml;.</i> These phrases, at first glance incoherent, can no doubt be justified in a cryptographical or allegorical manner; such a justification is verbal and, <i>ex hypothesi,</i> already figures in the Library.  I cannot combine some characters</p>
</td><td>
<p>Asertas la malpiuloj ke la nesenceco estas tute normala en la Biblioteko kaj ke la racio (samkiel la simpla kohereco) estas kvaza&#x16D;-mirakla escepto. Ili parolas (mi scias) pri la &ldquo;Fevra Biblioteko, kies hazardoplenaj libroj &#x109;iam sen&#x109;ese riskas ŝan&#x11D;i&#x11D;i al aliaj, kaj &#x109;ion asertas, neas kaj konfuzigas kiel frenezaj dioj.&rdquo; &#x108;i tiuj vortoj, kiuj ne nur denoncas la malordon, sed anka&#x16D; ilustras &#x11D;in, &#x11D;enerale pruvas la teruran pensokapablon kaj la senesperan malscion de tiuj, kiuj ilin elparolas. Verdire, la Biblioteko enhavas &#x109;iujn verbajn strukturojn, &#x109;iujn varia&#x135;ojn permesitaj de la dudek kvin ortografiaj simboloj, sed ne e&#x109; unu absolutan sensenca&#x135;on. Estas tute senutile montri al mi ke la plej bona libro de la heksagonoj, kiujn mi administras, titolas <i>Kombita Tondro</i>, alia <i>La Gipsa Kramfo</i> kaj alia <i>Axaxaxas ml&ouml;.</i> &#x108;i tiuj prepozicioj, unuavide nekoheraj, estas certe klarigeblaj alegorie a&#x16D; kriptografie; tiu klarigo estas pervorta, kaj tial, ex hypothesi, jam ekzistas en la Biblioteko. Mi ne povas imagi iun ajn kombina&#x135;on de literoj</p>
</td></tr><tr><td>
<p><i>dhcmrlchtdj</i></p>
</td><td>
<p><i>dhcmrlchtdj</i></p>
</td></tr><tr><td>
<p>which the divine Library has not foreseen and which in one of its secret tongues do not contain a terrible meaning.  No one can articulate a syllable which is not filled with tenderness and fear, which is not, in one of these languages, the powerful name of a god.  To speak is to fall into tautology.  This wordy and useless epistle already exists in one of the thirty volumes of the five shelves of one of the innumerable hexagons and its refutation as well.  (An <i>n</i> number of possible languages use the same vocabulary; in some of them, the symbol <i>library</i> allows the correct definition <i>a ubiquitous and lasting system of hexagonal galleries,</i> but <i>library</i> is <i>bread</I> or <i>pyramid</i> or anything else, and these seven words which define it have another value. You who read me, are You sure of understanding my language?)</p>
</td><td>
<p>kiun la Dia Biblioteko ne jam anta&#x16D;vidis, kaj kiu ne signifas ion en iu ajn el &#x11D;iaj sekretaj lingvoj. Neniu povas elparoli silabon, kiu ne plenas je dol&#x109;eco kaj hororo; kiu ne estas, en iu ajn el tiuj lingvoj, la pova nomo de iu Dio. Paroli estas produkti ta&#x16D;tologiojn. &#x108;i tiu senutila kaj parolema vortamaso jam ekzistas en iu el la tridek du libroj de la kvin bretoj de iu certa heksagono - samkiel &#x11D;ia neado. (Iu certa nombro <i>n</i> da eblaj lingvoj uzas la saman vortaron; en iuj, la simbolo <i>Biblioteko</i> konsentas la korektan difinon de <i>Longda&#x16D;ra kaj senlima sistemo de heksagonaj galerioj</i>, sed en aliaj Biblioteko signifas <i>pano</i>n, a&#x16D; <i>piramido</i>n, a&#x16D; iun ajn alian aferon, kaj por aliaj aferoj ekzistas sep vortoj kiuj ilin difinas. &#x108;u vi, mia leganto, certas, ke vi komprenas mian lingvon?)</p>
</td></tr><tr><td>
<p>The methodical task of writing distracts me from the present state of men. The certitude that everything has been written negates us or turns us into phantoms.  I know of districts in which the young men prostrate themselves before books and kiss their pages in a barbarous manner, but they do not know how to decipher a single letter.  Epidemics, heretical conflicts, peregrinations which inevitably degenerate into banditry, have decimated the population.  I believe I have mentioned suicides, more and more frequent with the years.  Perhaps my old age and fearfulness deceive me, but I suspect that the human species &mdash; the unique species &mdash; is about to be extinguished, but the Library will endure:  illuminated, solitary, infinite, perfectly motionless, equipped with precious volumes, useless, incorruptible, secret.</p>
</td><td>
<p>La metodika skribado distras min de la nuna kondi&#x109;o de la homoj, kiujn stultigas la certeco ke &#x109;io estas jam skribita. Mi scias pri kvartaloj en kiuj la junuloj surgenui&#x11D;as anta&#x16D; la libroj, barbare kisante iliajn pa&#x11D;ojn, sen scipovi de&#x109;ifri e&#x109; unu literon. La epidemioj, la herezaj malkonsentoj, la migradoj kiuj neeviteble kunportas banditecon, dek-on-igis la popolon de la heksagonoj. Eble mi jam paroletis pri la memmorti&#x11D;oj, &#x109;iun jaron pli oftaj. Eble miaj maljuneco kaj timo trompas min, sed mi opinias ke la homa speco &mdash; la nura &mdash; estas malaperonta, kaj ke nur la Biblioteko restos: iluminita, soleca, senfina, perfekte senmova, plenplena je valoregaj libroj, senutila, neruinebla kaj sekreta.</p>
</td></tr><tr><td>
<p>I have just written the word &ldquo;infinite.&rdquo;  I have not interpolated this adjective out of rhetorical habit; I say that it is not illogical to think that the world is infinite.  Those who judge it to be limited postulate that in remote places the corridors and stairways and hexagons can conceivably come to an end &mdash; which is absurd.  Those who imagine it to be without limit forget that the possible number of books does have such a limit.  I venture to suggest this solution to the ancient problem:  <i>The Library is unlimited and cyclical.</i>  If an eternal traveler were to cross it in any direction, after centuries he would see that the same volumes were repeated in the same disorder (which, thus repeated, would be an order:  the Order).  My solitude is gladdened by this elegant hope.<sup>(4)</sup></p>
</td><td>
<p>Mi aldonas: senfina. Mi ne prezentas tiun adjektivon pro retorika kutimo; mi simple diras ke ne mallogikas pensi ke &#x109;i tiu mondo estas senfina. Tiuj, kiuj opinias &#x11D;in limigita, supozas tial ke en iu malproksima loko la koridoroj kaj la ŝtuparoj povus &#x109;esi. Tio estas absurda&#x135;o! Tiuj kiuj imagas &#x11D;in senlima, forgesas ke estas ja limigita la nombro da libroj. Mi a&#x16D;dacas enŝovi &#x109;i tiun solvon: <i>la Biblioteko estas senlima kaj perioda.</i> Se iu &#x109;iama voja&#x11D;anto trairus &#x11D;in la&#x16D; iu ajn direkto, &#x11D;i konstatus je la fino de la jarcentoj, ke la samaj libroj ripeti&#x11D;as la&#x16D; la sama malordo (kiu fari&#x11D;us ordo: La Ordo). Tiu eleganta espero feli&#x109;igas mian solecon.<sup>(4)</sup></p>
</td></tr>
  <tr>
    <td>
      [1] The original manuscript does not contain digits or capital letters. The punctuation has been limited to the comma and the period. These two signs, the space and the twenty-two letters of the alphabet are the twenty-five symbols considered sufficient by this unknown author. <i>(Editor's note.)</i>
    </td>
    <td>
      [1] La origina manuskripto ne enhavas ciferojn nek majusklojn. La punktumado limi&#x11D;is al komo kaj punkto. Tiuj du signoj, la spaco, kaj la dudek du literoj de la alfabeto konsistigas la dudek kvin simbolojn, kiujn &#x109;i tiu nekonata a&#x16D;toro konsideras sufi&#x109;aj. <i>(Editora noto)</i>
    </td>
  </tr>
  <tr>
    <td>
      [2] Before, there was a man for every three hexagons. Suicide and pulmonary diseases have destroyed that proportion. A memory of unspeakable melancholy: at times I have traveled for many nights through corridors and along polished stairways without finding a single librarian.
    </td>
    <td>
      [2] Komence, estis homo por &#x109;iu tria heksagono. Memmortigo kaj pulmaj malsanoj detruis tiun proporcion. Memora&#x135;o de neparolebla melankolio: foje mi voja&#x11D;is multajn noktojn tra koridoroj kaj la&#x16D; poluritaj ŝtuparoj sen e&#x109; trovi unu bibliotekisto.
    </td>
  </tr>
  <tr>
    <td>
      [3] I repeat: it suffices that a book be possible for it to exist. Only the impossible is excluded. For example: no book can be a ladder, although no doubt there are books which discuss and negate and demonstrate this possibility and others whose structure corresponds to that of a ladder.    </td>
    <td>
      [3] Mi ripetu: nur sufi&#x109;as, ke libro eblu, por ke &#x11D;i ekzistu. Nur la neeblo ekskludi&#x11D;as. Ekzemple: neniu libro povas esti eskalo, kvankam sendume estas libroj kiuj debatas, neas kaj pruvas tiun eblon, kaj aliaj kies strukturo respondas al tiu de eskalo.
    </td>
  </tr>
  <tr>
    <td>
      [4] Letizia &Agrave;lvarez de Toledo has observed that this vast Library is useless: rigorously speaking, <i>a single volume</i> would be sufficient, a volume of ordinary format, printed in nine or ten point type, containing an infinite number if infinitely thin leaves. (In the early seventeenth century, Cavalieri said that all solid bodies are the superimposition of an infinite number of planes.) The handling of this silky vade mecum would not be convenient: each apparent page would unfold into other analogous ones; the inconceivable middle page would have no reverse.
    </td>
    <td>
      [4] Letizia &Agrave;lvarez de Toledo rimarkis ke &#x109;i tiu vasta Biblioteko estas senutila: la&#x16D; rigoraj terminoj, <i>unu nura volumo</i> estus sufi&#x109;a, kutimformata volumo, presita en tipo na&#x16D;- a&#x16D; dekpunkta, kaj enhavanta senfinan nombron da senfine maldikaj folioj. (En la frua deksepa jarcento, Cavalieri diris ke &#x109;iu solida&#x135;o estas supermeto de senfina kvanto da ebenoj.) &#x108;i tiun vademekumon oni malfacile manuzus: &#x109;iu ŝajna pa&#x11D;o malfaldi&#x11D;us en aliaj egalaj; la neimagebla meza pa&#x11D;o ne havus dorson.
    </td>
  </tr>
</table>
<h5>Redaktis Format la pa&gcirc;on.</h5>
<br><br>
</body>
</html>
